org/2023-06-22-Guix_Dive_2.org
#+OPTIONS: toc:nil num:nil
#+BEGIN_EXPORT html
---
layout: post
title: Diving into the Guix internals (part 2)
permalink: /:title/
tags: [guix, scheme]
---
#+END_EXPORT
Welcome to the second part of the Guix deep dive! Today we will be looking a bit deeper into the ~operating-system~ record, mostly into system services, 
how they are implemented and how we can configure them.

Before you read further I strongly recommend reading [[https://cuberjan.github.io/Guix_Dive/][the first part]] as it provides some context to what we will be doing now.
I'll also be referring to the system configuration from that other post.

This time we'll look at the surface level of how Guix handles services and their configuration.

* The default services
Yet again we can find the default service list by peeking into the ~operating-system~ record.

#+begin_src scheme
  (services operating-system-user-services        ; list of services
	    (thunked)                     ;allow for system-dependent services
	    (default %base-services))
#+end_src

This time, let's actually find the ~service~ record first. Finding the scheme definition for services was really straightforward - it's at ~gnu/services.scm~.
Once inside the file we can look for the ~service~ record with a simple search and immediately the following definition is found.
#+begin_src scheme
  ;; Services of a given type.
  (define-record-type <service>
    (make-service type value)
    service?
    (type       service-kind)
    (value      service-value))
#+end_src
As you can see services are actually only defined as 2 variables - the service type and value. Take note of the ~service-kind~ accessor, we're going to use it later.

