_posts/2023-06-22-Guix_Dive_2.html
---
layout: post
title: Diving into the Guix internals (part 2)
permalink: /:title/
tags: [guix, scheme]
---
<p>
Welcome to the second part of the Guix deep dive! Today we will be looking a bit deeper into the <code>operating-system</code> record, mostly into system services, 
how they are implemented and how we can configure them.
</p>

<p>
Before you read further I strongly recommend reading <a href="https://cuberjan.github.io/Guix_Dive/">the first part</a> as it provides some context to what we will be doing now.
I'll also be referring to the system configuration from that other post.
</p>

<p>
This time we'll look at the surface level of how Guix handles services and their configuration.
</p>

<div id="outline-container-org5b3674d" class="outline-2">
<h2 id="org5b3674d">The default services</h2>
<div class="outline-text-2" id="text-org5b3674d">
<p>
Yet again we can find the default service list by peeking into the <code>operating-system</code> record.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>services operating-system-user-services        <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of services</span>
          <span style="color: #7388D6;">(</span>thunked<span style="color: #7388D6;">)</span>                     <span style="color: #8D8D84; font-style: italic;">;</span><span style="color: #8D8D84; font-style: italic;">allow for system-dependent services</span>
          <span style="color: #7388D6;">(</span>default %base-services<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
This time, let's actually find the <code>service</code> record first. Finding the scheme definition for services was really straightforward - it's at <code>gnu/services.scm</code>.
Once inside the file we can look for the <code>service</code> record with a simple search and immediately the following definition is found.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">Services of a given type.</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">define-record-type</span> <span style="color: #6434A3;">&lt;service&gt;</span>
  <span style="color: #7388D6;">(</span>make-service type value<span style="color: #7388D6;">)</span>
  service?
  <span style="color: #7388D6;">(</span>type       service-kind<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>value      service-value<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
As you can see services are actually only defined as 2 variables - the service type and value. Take note of the <code>service-kind</code> accessor, we're going to use it later.
</p>
</div>
</div>
