org/2023-06-22-Guix_Dive_2.org
* Service type

Let's first take a look at the service ~type.~ Yet again we can look at the record definition.
#+begin_src scheme
  (define-record-type* <service-type> service-type make-service-type
    service-type?
    (name       service-type-name)                  ;symbol (for debugging)

    ;; Things extended by services of this type.
    (extensions service-type-extensions)            ;list of <service-extensions>

    ;; Given a list of extensions, "compose" them.
    (compose    service-type-compose                ;list of Any -> Any
		(default #f))

    ;; Extend the services' own parameters with the extension composition.
    (extend     service-type-extend                 ;list of Any -> parameters
		(default #f))

    ;; Optional default value for instances of this type.
    (default-value service-type-default-value       ;Any
      (default &no-default-value))

    ;; Meta-data.
    (description  service-type-description)         ;string
    (location     service-type-location             ;<location>
		  (default (and=> (current-source-location)
				  source-properties->location))
		  (innate)))
#+end_src
Most slots here are pretty self-explanatory, aside from ~compose~, ~extend~ and ~extensions~.
I'm going to refer to the Guix documentation as it provides a short and clear explanation of what these do - my explanation effort here would be redundant.
[[https://guix.gnu.org/manual/en/html_node/Service-Composition.html][Here's the link.]]

With this we can go ahead and dissect the ~%desktop-services~ which I use in my config. Let's start with printing their names, left in for debugging purposes
#+begin_src scheme
  scheme@(guile-user)> (map (lambda (service) (service-type-name (service-kind service))) %desktop-services)
  $9 = (gdm screen-locker screen-locker mtp sane polkit-wheel mount-setuid-helpers gdm-file-system fontconfig-file-system network-manager wpa-supplicant network-manager-applet modem-manager usb-modeswitch avahi udisks upower accountsservice cups-pk-helper colord geoclue polkit elogind dbus ntp x11-socket-directory-service pulseaudio alsa login virtual-terminal console-fonts syslog agetty mingetty mingetty mingetty mingetty mingetty mingetty static-networking urandom-seed guix nscd rottlog log-cleanup udev sysctl special-files)
#+end_src
We first extract the service type with ~service-kind~, followed by extracting that types name with ~service-type-name~.

This can already give us some ideas for how service lists can be modified, let's remove the ~gdm~ service and then print the service list.
#+begin_src scheme
  scheme@(guile-user)>
    (map (lambda (service) (service-type-name (service-kind service))) 
	 (remove (lambda (service) (equal? (service-type-name (service-kind service)) 'gdm)) %desktop-services))

  $14 = (screen-locker screen-locker mtp sane polkit-wheel mount-setuid-helpers gdm-file-system fontconfig-file-system network-manager wpa-supplicant network-manager-applet modem-manager usb-modeswitch avahi udisks upower accountsservice cups-pk-helper colord geoclue polkit elogind dbus ntp x11-socket-directory-service pulseaudio alsa login virtual-terminal console-fonts syslog agetty mingetty mingetty mingetty mingetty mingetty mingetty static-networking urandom-seed guix nscd rottlog log-cleanup udev sysctl special-files)
#+end_src
Again we simply extract the service type name, then filter it by comparing it against the quoted ~gdm~ symbol. The ~map~ here is the same as above, used to print the list in a readable format. 
We can also remove services by comparing service types instead.

If we take a quick peek at the config we can see something like this:
#+begin_src scheme
  (define %my-services
    (modify-services %desktop-services
      (delete gdm-service-type)
      (guix-service-type config => (guix-configuration
				    (inherit config)
				    (substitute-urls
				     (append (list "https://substitutes.nonguix.org")
					     %default-substitute-urls))
				    (authorized-keys
				     (append (list (local-file "./signing-key.pub"))
					     %default-authorized-guix-keys))))
      (dbus-root-service-type config =>
			      (dbus-configuration (inherit config)
						  (services (list libratbag blueman))))))
#+end_src
As you can see Guix provides a ~modify-services~ macro, which abstracts service deletion away, making our effort kind of unnecessary... 
but at least we now understand how that part of the macro works under the hood and we learned a little about service types along the way.

