_posts/2023-06-22-Guix_Dive_2.html

<div id="outline-container-org268556e" class="outline-2">
<h2 id="org268556e">Service type</h2>
<div class="outline-text-2" id="text-org268556e">
<p>
Let's first take a look at the service <code>type.</code> Yet again we can look at the record definition.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>define-record-type* <span style="color: #6434A3;">&lt;service-type&gt;</span> service-type make-service-type
  service-type?
  <span style="color: #7388D6;">(</span>name       service-type-name<span style="color: #7388D6;">)</span>                  <span style="color: #8D8D84; font-style: italic;">;</span><span style="color: #8D8D84; font-style: italic;">symbol (for debugging)</span>

  <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">Things extended by services of this type.</span>
  <span style="color: #7388D6;">(</span>extensions service-type-extensions<span style="color: #7388D6;">)</span>            <span style="color: #8D8D84; font-style: italic;">;</span><span style="color: #8D8D84; font-style: italic;">list of &lt;service-extensions&gt;</span>

  <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">Given a list of extensions, "compose" them.</span>
  <span style="color: #7388D6;">(</span>compose    service-type-compose                <span style="color: #8D8D84; font-style: italic;">;</span><span style="color: #8D8D84; font-style: italic;">list of Any -&gt; Any</span>
              <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">Extend the services' own parameters with the extension composition.</span>
  <span style="color: #7388D6;">(</span>extend     service-type-extend                 <span style="color: #8D8D84; font-style: italic;">;</span><span style="color: #8D8D84; font-style: italic;">list of Any -&gt; parameters</span>
              <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">Optional default value for instances of this type.</span>
  <span style="color: #7388D6;">(</span>default-value service-type-default-value       <span style="color: #8D8D84; font-style: italic;">;</span><span style="color: #8D8D84; font-style: italic;">Any</span>
    <span style="color: #909183;">(</span>default &amp;no-default-value<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">Meta-data.</span>
  <span style="color: #7388D6;">(</span>description  service-type-description<span style="color: #7388D6;">)</span>         <span style="color: #8D8D84; font-style: italic;">;</span><span style="color: #8D8D84; font-style: italic;">string</span>
  <span style="color: #7388D6;">(</span>location     service-type-location             <span style="color: #8D8D84; font-style: italic;">;</span><span style="color: #8D8D84; font-style: italic;">&lt;location&gt;</span>
                <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>and=&gt; <span style="color: #907373;">(</span>current-source-location<span style="color: #907373;">)</span>
                                source-properties-&gt;location<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>innate<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
Most slots here are pretty self-explanatory, aside from <code>compose</code>, <code>extend</code> and <code>extensions</code>.
I'm going to refer to the Guix documentation as it provides a short and clear explanation of what these do - my explanation effort here would be redundant.
<a href="https://guix.gnu.org/manual/en/html_node/Service-Composition.html">Here's the link.</a>
</p>

<p>
With this we can go ahead and dissect the <code>%desktop-services</code> which I use in my config. Let's start with printing their names, left in for debugging purposes
</p>
<div class="org-src-container">
<pre class="src src-scheme">scheme@<span style="color: #707183;">(</span>guile-user<span style="color: #707183;">)</span>&gt; <span style="color: #707183;">(</span><span style="color: #0000FF;">map</span> <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>service<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>service-type-name <span style="color: #709870;">(</span>service-kind service<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span> %desktop-services<span style="color: #707183;">)</span>
$9 = <span style="color: #707183;">(</span>gdm screen-locker screen-locker mtp sane polkit-wheel mount-setuid-helpers gdm-file-system fontconfig-file-system network-manager wpa-supplicant network-manager-applet modem-manager usb-modeswitch avahi udisks upower accountsservice cups-pk-helper colord geoclue polkit elogind dbus ntp x11-socket-directory-service pulseaudio alsa login virtual-terminal console-fonts syslog agetty mingetty mingetty mingetty mingetty mingetty mingetty static-networking urandom-seed guix nscd rottlog log-cleanup udev sysctl special-files<span style="color: #707183;">)</span>
</pre>
</div>
<p>
We first extract the service type with <code>service-kind</code>, followed by extracting that types name with <code>service-type-name</code>.
</p>

<p>
This can already give us some ideas for how service lists can be modified, let's remove the <code>gdm</code> service and then print the service list.
</p>
<div class="org-src-container">
<pre class="src src-scheme">scheme@<span style="color: #707183;">(</span>guile-user<span style="color: #707183;">)</span>&gt;
  <span style="color: #707183;">(</span><span style="color: #0000FF;">map</span> <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>service<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>service-type-name <span style="color: #709870;">(</span>service-kind service<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span> 
       <span style="color: #7388D6;">(</span>remove <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>service<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>equal? <span style="color: #907373;">(</span>service-type-name <span style="color: #6276BA;">(</span>service-kind service<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span> 'gdm<span style="color: #709870;">)</span><span style="color: #909183;">)</span> %desktop-services<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

$14 = <span style="color: #707183;">(</span>screen-locker screen-locker mtp sane polkit-wheel mount-setuid-helpers gdm-file-system fontconfig-file-system network-manager wpa-supplicant network-manager-applet modem-manager usb-modeswitch avahi udisks upower accountsservice cups-pk-helper colord geoclue polkit elogind dbus ntp x11-socket-directory-service pulseaudio alsa login virtual-terminal console-fonts syslog agetty mingetty mingetty mingetty mingetty mingetty mingetty static-networking urandom-seed guix nscd rottlog log-cleanup udev sysctl special-files<span style="color: #707183;">)</span>
</pre>
</div>
<p>
Again we simply extract the service type name, then filter it by comparing it against the quoted <code>gdm</code> symbol. The <code>map</code> here is the same as above, used to print the list in a readable format. 
We can also remove services by comparing service types instead.
</p>

<p>
If we take a quick peek at the config we can see something like this:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #0000FF;">define</span> <span style="color: #006699;">%my-services</span>
  <span style="color: #7388D6;">(</span>modify-services %desktop-services
    <span style="color: #909183;">(</span>delete gdm-service-type<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>guix-service-type config =&gt; <span style="color: #709870;">(</span>guix-configuration
                                  <span style="color: #907373;">(</span>inherit config<span style="color: #907373;">)</span>
                                  <span style="color: #907373;">(</span>substitute-urls
                                   <span style="color: #6276BA;">(</span>append <span style="color: #858580;">(</span>list <span style="color: #008000;">"https://substitutes.nonguix.org"</span><span style="color: #858580;">)</span>
                                           %default-substitute-urls<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
                                  <span style="color: #907373;">(</span>authorized-keys
                                   <span style="color: #6276BA;">(</span>append <span style="color: #858580;">(</span>list <span style="color: #80A880;">(</span>local-file <span style="color: #008000;">"./signing-key.pub"</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                                           %default-authorized-guix-keys<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>dbus-root-service-type config =&gt;
                            <span style="color: #709870;">(</span>dbus-configuration <span style="color: #907373;">(</span>inherit config<span style="color: #907373;">)</span>
                                                <span style="color: #907373;">(</span>services <span style="color: #6276BA;">(</span>list libratbag blueman<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
As you can see Guix provides a <code>modify-services</code> macro, which abstracts service deletion away, making our effort kind of unnecessary&#x2026; 
but at least we now understand how that part of the macro works under the hood and we learned a little about service types along the way.
</p>
</div>
</div>
