org/2023-06-22-Guix_Dive_2.org
* Looking into actual services
I think now is a good time to look at how an actual service is implemented. I'll use the ~gdm~ service again.

First of all let's find the definition of ~gdm-service-type~. I'll use ~M-.~ to get there right away.

#+begin_src scheme
  (define gdm-service-type
    (handle-xorg-configuration gdm-configuration
      (service-type (name 'gdm)
		    (extensions
		     (list (service-extension shepherd-root-service-type
					      gdm-shepherd-service)
			   (service-extension account-service-type
					      (const %gdm-accounts))
			   (service-extension dconf-service-type
					      gdm-dconf-profiles)
			   (service-extension pam-root-service-type
					      gdm-pam-service)
			   (service-extension polkit-service-type
					      gdm-polkit-rules)
			   (service-extension profile-service-type
					      gdm-configuration-gnome-shell-assets)
			   (service-extension dbus-root-service-type
					      (compose list
						       gdm-configuration-gdm))
			   (service-extension localed-service-type
					      (compose
					       xorg-configuration-keyboard-layout
					       gdm-configuration-xorg))))
		    (default-value (gdm-configuration))
		    (description
		     "Run the GNOME Desktop Manager (GDM), a program that allows
  you to log in in a graphical session, whether or not you use GNOME."))))
#+end_src
Here we can see which services are extended by GDM.

The logical next step is the ~gdm-configuration~ which is another record that looks as follows:
#+begin_src scheme
  (define-record-type* <gdm-configuration>
    gdm-configuration make-gdm-configuration
    gdm-configuration?
    (gdm gdm-configuration-gdm (default gdm))
    (allow-empty-passwords? gdm-configuration-allow-empty-passwords? (default #t))
    (auto-login? gdm-configuration-auto-login? (default #f))
    (auto-suspend? gdm-configuration-auto-suspend? (default #t))
    (dbus-daemon gdm-configuration-dbus-daemon (default dbus-daemon-wrapper))
    (debug? gdm-configuration-debug? (default #f))
    (default-user gdm-configuration-default-user (default #f))
    (gnome-shell-assets gdm-configuration-gnome-shell-assets
			(default (list adwaita-icon-theme font-abattis-cantarell)))
    (xorg-configuration gdm-configuration-xorg
			(default (xorg-configuration)))
    (x-session gdm-configuration-x-session
	       (default (xinitrc)))
    (xdmcp? gdm-configuration-xdmcp?
	    (default #f))
    (wayland? gdm-configuration-wayland? (default #f))
    (wayland-session gdm-configuration-wayland-session
		     (default gdm-wayland-session-wrapper)))
#+end_src
This gives us more insight into how the service can be configured.

The ~gdm~ slot is rather interesting here as it defines which package the service is going to use. We're going to apply this knowledge practically later.

If we want to look into how the service configuration is defined then ~gdm-shepherd-service~ is what we're looking for.
#+begin_src scheme
  (define (gdm-shepherd-service config)
    (define config-file
      (gdm-configuration-file config))

    (list (shepherd-service
	   (documentation "Xorg display server (GDM)")
	   (provision '(xorg-server))
	   (requirement '(dbus-system pam user-processes host-name udev elogind))
	   (start #~(lambda ()
		      (fork+exec-command
		       (list #$(file-append (gdm-configuration-gdm config)
					    "/bin/gdm"))
		       #:environment-variables
		       (list #$@(if (gdm-configuration-auto-suspend? config)
				    #~()
				    #~("DCONF_PROFILE=/etc/dconf/profile/gdm"))
			     (string-append "GDM_CUSTOM_CONF=" #$config-file)
			     (string-append
			      "GDM_DBUS_DAEMON="
			      #$(gdm-configuration-dbus-daemon config))
			     (string-append
			      "GDM_X_SERVER="
			      #$(xorg-wrapper
				 (gdm-configuration-xorg config)))
			     (string-append
			      "GDM_X_SESSION="
			      #$(gdm-configuration-x-session config))
			     (string-append
			      "XDG_DATA_DIRS="
			      ((lambda (ls) (string-join ls ":"))
			       (map (lambda (path)
				      (string-append path "/share"))
				    ;; XXX: Remove gnome-shell below when GDM
				    ;; can depend on GNOME Shell directly.
				    (cons #$gnome-shell
					  '#$(gdm-configuration-gnome-shell-assets
					      config)))))
			     ;; Add XCURSOR_PATH so that mutter can find its
			     ;; cursors.  gdm doesn't login so doesn't source
			     ;; the corresponding line in /etc/profile.
			     "XCURSOR_PATH=/run/current-system/profile/share/icons"
			     (string-append
			      "GDK_PIXBUF_MODULE_FILE="
			      #$gnome-shell "/" #$%gdk-pixbuf-loaders-cache-file)
			     (string-append
			      "GDM_WAYLAND_SESSION="
			      #$(gdm-configuration-wayland-session config))))))
	   (stop #~(make-kill-destructor))
	   (actions (list (shepherd-configuration-action config-file)))
	   (respawn? #t))))
#+end_src
We can see how Guix composes the GDM configuration file and writes the configuration, as well as the ~start~ process for the service - in this case a simple invocation of the ~gdm~ command.
It's also seen here that the GDM service provides the ~xorg-server~ service. This means if we added another instance of that to our config we would actually get a duplicate which is no good.

~shepherd-service~ is a whole another can of worms - we'll learn about that some other time.

