_posts/2023-06-22-Guix_Dive_2.html

<div id="outline-container-org10b9a5c" class="outline-2">
<h2 id="org10b9a5c">Looking into actual services</h2>
<div class="outline-text-2" id="text-org10b9a5c">
<p>
I think now is a good time to look at how an actual service is implemented. I'll use the <code>gdm</code> service again.
</p>

<p>
First of all let's find the definition of <code>gdm-service-type</code>. I'll use <code>M-.</code> to get there right away.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #0000FF;">define</span> <span style="color: #006699;">gdm-service-type</span>
  <span style="color: #7388D6;">(</span>handle-xorg-configuration gdm-configuration
    <span style="color: #909183;">(</span>service-type <span style="color: #709870;">(</span>name 'gdm<span style="color: #709870;">)</span>
                  <span style="color: #709870;">(</span>extensions
                   <span style="color: #907373;">(</span>list <span style="color: #6276BA;">(</span>service-extension shepherd-root-service-type
                                            gdm-shepherd-service<span style="color: #6276BA;">)</span>
                         <span style="color: #6276BA;">(</span>service-extension account-service-type
                                            <span style="color: #858580;">(</span>const %gdm-accounts<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                         <span style="color: #6276BA;">(</span>service-extension dconf-service-type
                                            gdm-dconf-profiles<span style="color: #6276BA;">)</span>
                         <span style="color: #6276BA;">(</span>service-extension pam-root-service-type
                                            gdm-pam-service<span style="color: #6276BA;">)</span>
                         <span style="color: #6276BA;">(</span>service-extension polkit-service-type
                                            gdm-polkit-rules<span style="color: #6276BA;">)</span>
                         <span style="color: #6276BA;">(</span>service-extension profile-service-type
                                            gdm-configuration-gnome-shell-assets<span style="color: #6276BA;">)</span>
                         <span style="color: #6276BA;">(</span>service-extension dbus-root-service-type
                                            <span style="color: #858580;">(</span>compose list
                                                     gdm-configuration-gdm<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                         <span style="color: #6276BA;">(</span>service-extension localed-service-type
                                            <span style="color: #858580;">(</span>compose
                                             xorg-configuration-keyboard-layout
                                             gdm-configuration-xorg<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                  <span style="color: #709870;">(</span>default-value <span style="color: #907373;">(</span>gdm-configuration<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                  <span style="color: #709870;">(</span>description
                   <span style="color: #008000;">"Run the GNOME Desktop Manager (GDM), a program that allows</span>
<span style="color: #008000;">you to log in in a graphical session, whether or not you use GNOME."</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
Here we can see which services are extended by GDM.
</p>

<p>
The logical next step is the <code>gdm-configuration</code> which is another record that looks as follows:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>define-record-type* <span style="color: #6434A3;">&lt;gdm-configuration&gt;</span>
  gdm-configuration make-gdm-configuration
  gdm-configuration?
  <span style="color: #7388D6;">(</span>gdm gdm-configuration-gdm <span style="color: #909183;">(</span>default gdm<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>allow-empty-passwords? gdm-configuration-allow-empty-passwords? <span style="color: #909183;">(</span>default #t<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>auto-login? gdm-configuration-auto-login? <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>auto-suspend? gdm-configuration-auto-suspend? <span style="color: #909183;">(</span>default #t<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>dbus-daemon gdm-configuration-dbus-daemon <span style="color: #909183;">(</span>default dbus-daemon-wrapper<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>debug? gdm-configuration-debug? <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>default-user gdm-configuration-default-user <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>gnome-shell-assets gdm-configuration-gnome-shell-assets
                      <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>list adwaita-icon-theme font-abattis-cantarell<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>xorg-configuration gdm-configuration-xorg
                      <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>xorg-configuration<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>x-session gdm-configuration-x-session
             <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>xinitrc<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>xdmcp? gdm-configuration-xdmcp?
          <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>wayland? gdm-configuration-wayland? <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>wayland-session gdm-configuration-wayland-session
                   <span style="color: #909183;">(</span>default gdm-wayland-session-wrapper<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
This gives us more insight into how the service can be configured.
</p>

<p>
The <code>gdm</code> slot is rather interesting here as it defines which package the service is going to use. We're going to apply this knowledge practically later.
</p>

<p>
If we want to look into how the service configuration is defined then <code>gdm-shepherd-service</code> is what we're looking for.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #0000FF;">define</span> <span style="color: #7388D6;">(</span><span style="color: #006699;">gdm-shepherd-service</span> config<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">define</span> <span style="color: #006699;">config-file</span>
    <span style="color: #909183;">(</span>gdm-configuration-file config<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>list <span style="color: #909183;">(</span>shepherd-service
         <span style="color: #709870;">(</span>documentation <span style="color: #008000;">"Xorg display server (GDM)"</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>provision '<span style="color: #907373;">(</span>xorg-server<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>requirement '<span style="color: #907373;">(</span>dbus-system pam user-processes host-name udev elogind<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>start #~<span style="color: #907373;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #6276BA;">()</span>
                    <span style="color: #6276BA;">(</span>fork+exec-command
                     <span style="color: #858580;">(</span>list #$<span style="color: #80A880;">(</span>file-append <span style="color: #887070;">(</span>gdm-configuration-gdm config<span style="color: #887070;">)</span>
                                          <span style="color: #008000;">"/bin/gdm"</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                     <span style="color: #006FE0;">#:environment-variables</span>
                     <span style="color: #858580;">(</span>list #$@<span style="color: #80A880;">(</span><span style="color: #0000FF;">if</span> <span style="color: #887070;">(</span>gdm-configuration-auto-suspend? config<span style="color: #887070;">)</span>
                                  #~<span style="color: #887070;">()</span>
                                  #~<span style="color: #887070;">(</span><span style="color: #008000;">"DCONF_PROFILE=/etc/dconf/profile/gdm"</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                           <span style="color: #80A880;">(</span>string-append <span style="color: #008000;">"GDM_CUSTOM_CONF="</span> #$config-file<span style="color: #80A880;">)</span>
                           <span style="color: #80A880;">(</span>string-append
                            <span style="color: #008000;">"GDM_DBUS_DAEMON="</span>
                            #$<span style="color: #887070;">(</span>gdm-configuration-dbus-daemon config<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                           <span style="color: #80A880;">(</span>string-append
                            <span style="color: #008000;">"GDM_X_SERVER="</span>
                            #$<span style="color: #887070;">(</span>xorg-wrapper
                               <span style="color: #707183;">(</span>gdm-configuration-xorg config<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                           <span style="color: #80A880;">(</span>string-append
                            <span style="color: #008000;">"GDM_X_SESSION="</span>
                            #$<span style="color: #887070;">(</span>gdm-configuration-x-session config<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                           <span style="color: #80A880;">(</span>string-append
                            <span style="color: #008000;">"XDG_DATA_DIRS="</span>
                            <span style="color: #887070;">(</span><span style="color: #707183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #7388D6;">(</span>ls<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>string-join ls <span style="color: #008000;">":"</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
                             <span style="color: #707183;">(</span><span style="color: #0000FF;">map</span> <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>path<span style="color: #909183;">)</span>
                                    <span style="color: #909183;">(</span>string-append path <span style="color: #008000;">"/share"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
                                  <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">XXX: Remove gnome-shell below when GDM</span>
                                  <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">can depend on GNOME Shell directly.</span>
                                  <span style="color: #7388D6;">(</span>cons #$gnome-shell
                                        '#$<span style="color: #909183;">(</span>gdm-configuration-gnome-shell-assets
                                            config<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                           <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">Add XCURSOR_PATH so that mutter can find its</span>
                           <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">cursors.  gdm doesn't login so doesn't source</span>
                           <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">the corresponding line in /etc/profile.</span>
                           <span style="color: #008000;">"XCURSOR_PATH=/run/current-system/profile/share/icons"</span>
                           <span style="color: #80A880;">(</span>string-append
                            <span style="color: #008000;">"GDK_PIXBUF_MODULE_FILE="</span>
                            #$gnome-shell <span style="color: #008000;">"/"</span> #$%gdk-pixbuf-loaders-cache-file<span style="color: #80A880;">)</span>
                           <span style="color: #80A880;">(</span>string-append
                            <span style="color: #008000;">"GDM_WAYLAND_SESSION="</span>
                            #$<span style="color: #887070;">(</span>gdm-configuration-wayland-session config<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>stop #~<span style="color: #907373;">(</span>make-kill-destructor<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>actions <span style="color: #907373;">(</span>list <span style="color: #6276BA;">(</span>shepherd-configuration-action config-file<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>respawn? #t<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
We can see how Guix composes the GDM configuration file and writes the configuration, as well as the <code>start</code> process for the service - in this case a simple invocation of the <code>gdm</code> command.
It's also seen here that the GDM service provides the <code>xorg-server</code> service. This means if we added another instance of that to our config we would actually get a duplicate which is no good.
</p>

<p>
<code>shepherd-service</code> is a whole another can of worms - we'll learn about that some other time.
</p>
</div>
</div>
