org/2023-06-22-Guix_Dive_2.org
* A practical usage example
I think we have already learned enough for now. We can use the newfound knowledge in all sorts of practical and interesting ways.

One of the common questions I've seen asked by Guix users is how one would go about stripping their desktop environment of unnecessary packages - so let's try that!

I'll be modifying Gnome as it ships with a lot of unnecessary stuff by default. Let's start with the ~gnome-desktop-service-type~.
#+begin_src scheme
  (define gnome-desktop-service-type
    (service-type
     (name 'gnome-desktop)
     (extensions
      (list (service-extension udev-service-type
			       gnome-udev-rules)
	    (service-extension polkit-service-type
			       gnome-polkit-settings)
	    (service-extension setuid-program-service-type
			       gnome-setuid-programs)
	    (service-extension profile-service-type
			       (compose list gnome-desktop-configuration-gnome))))
     (default-value (gnome-desktop-configuration))
     (description "Run the GNOME desktop environment.")))
#+end_src
The ~gnome-desktop-configuration~ is what we want here, let's pull up its definition.
#+begin_src scheme
  (define-record-type* <gnome-desktop-configuration> gnome-desktop-configuration
    make-gnome-desktop-configuration
    gnome-desktop-configuration?
    (gnome gnome-desktop-configuration-gnome
	   (default gnome)))
#+end_src
And here we can see what we're looking for - the ~gnome~ slot. This slot defines which Gnome package is used for the service. If we replace this package with a stripped-down version, we can remove all the bloat we don't want.

So let's make that stripped-down version of Gnome and remove all the stuff we don't want. 
We haven't been through defining packages yet, so this here is a bit of magic we will investigate some other time.
#+begin_src scheme
  (define my-gnome
    (package
     (inherit gnome)
     (name "my-gnome")
     (propagated-inputs
      (modify-inputs (package-propagated-inputs gnome)
		     (delete "epiphany")
		     (delete "gnome-weather")
		     (delete "simple-scan")
		     (delete "gnome-maps")
		     (delete "cheese")
		     (delete "gnome-boxes")
		     (delete "gnome-console")
		     (delete "gnome-contacts")
		     (append gnome-terminal)))))
#+end_src
We add this package definition to our system config, then move on to defining the service.

Now we construct service type such that is uses a custom ~gnome-configuration~ - which we tell to use our custom ~my-gnome~ package. 
This is practically all just playing around with the records we looked at above.
#+begin_src scheme
  (operating-system
    ...
    (services
     (cons* 
      (service gnome-desktop-service-type
	       (gnome-configuration
		(gnome my-gnome)))
      %desktop-services))
    ...
  )
#+end_src

* End of part 2
By now we can find almost every detail about a service without ever opening its documentation - a good example of how Guix is self-documenting. 
With this knowledge we have great power in customizing the system services but we unfortunately can't write our own yet.

Next time I'd like to look a little deeper into service definition and even define some basic services. After that we can move onto one of the most exciting parts - defining and building our own packages!
