_posts/2023-06-22-Guix_Dive_2.html

<div id="outline-container-orgfa571e1" class="outline-2">
<h2 id="orgfa571e1">A practical usage example</h2>
<div class="outline-text-2" id="text-orgfa571e1">
<p>
I think we have already learned enough for now. We can use the newfound knowledge in all sorts of practical and interesting ways.
</p>

<p>
One of the common questions I've seen asked by Guix users is how one would go about stripping their desktop environment of unnecessary packages - so let's try that!
</p>

<p>
I'll be modifying Gnome as it ships with a lot of unnecessary stuff by default. Let's start with the <code>gnome-desktop-service-type</code>.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #0000FF;">define</span> <span style="color: #006699;">gnome-desktop-service-type</span>
  <span style="color: #7388D6;">(</span>service-type
   <span style="color: #909183;">(</span>name 'gnome-desktop<span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>extensions
    <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span>service-extension udev-service-type
                             gnome-udev-rules<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>service-extension polkit-service-type
                             gnome-polkit-settings<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>service-extension setuid-program-service-type
                             gnome-setuid-programs<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>service-extension profile-service-type
                             <span style="color: #6276BA;">(</span>compose list gnome-desktop-configuration-gnome<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>default-value <span style="color: #709870;">(</span>gnome-desktop-configuration<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>description <span style="color: #008000;">"Run the GNOME desktop environment."</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
The <code>gnome-desktop-configuration</code> is what we want here, let's pull up its definition.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>define-record-type* <span style="color: #6434A3;">&lt;gnome-desktop-configuration&gt;</span> gnome-desktop-configuration
  make-gnome-desktop-configuration
  gnome-desktop-configuration?
  <span style="color: #7388D6;">(</span>gnome gnome-desktop-configuration-gnome
         <span style="color: #909183;">(</span>default gnome<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
And here we can see what we're looking for - the <code>gnome</code> slot. This slot defines which Gnome package is used for the service. If we replace this package with a stripped-down version, we can remove all the bloat we don't want.
</p>

<p>
So let's make that stripped-down version of Gnome and remove all the stuff we don't want. 
We haven't been through defining packages yet, so this here is a bit of magic we will investigate some other time.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #0000FF;">define</span> <span style="color: #006699;">my-gnome</span>
  <span style="color: #7388D6;">(</span>package
   <span style="color: #909183;">(</span>inherit gnome<span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>name <span style="color: #008000;">"my-gnome"</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>propagated-inputs
    <span style="color: #709870;">(</span>modify-inputs <span style="color: #907373;">(</span>package-propagated-inputs gnome<span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>delete <span style="color: #008000;">"epiphany"</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>delete <span style="color: #008000;">"gnome-weather"</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>delete <span style="color: #008000;">"simple-scan"</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>delete <span style="color: #008000;">"gnome-maps"</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>delete <span style="color: #008000;">"cheese"</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>delete <span style="color: #008000;">"gnome-boxes"</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>delete <span style="color: #008000;">"gnome-console"</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>delete <span style="color: #008000;">"gnome-contacts"</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>append gnome-terminal<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
We add this package definition to our system config, then move on to defining the service.
</p>

<p>
Now we construct service type such that is uses a custom <code>gnome-configuration</code> - which we tell to use our custom <code>my-gnome</code> package. 
This is practically all just playing around with the records we looked at above.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>operating-system
  ...
  <span style="color: #7388D6;">(</span>services
   <span style="color: #909183;">(</span>cons* 
    <span style="color: #709870;">(</span>service gnome-desktop-service-type
             <span style="color: #907373;">(</span>gnome-configuration
              <span style="color: #6276BA;">(</span>gnome my-gnome<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    %desktop-services<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  ...
<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf547eb6" class="outline-2">
<h2 id="orgf547eb6">End of part 2</h2>
<div class="outline-text-2" id="text-orgf547eb6">
<p>
By now we can find almost every detail about a service without ever opening its documentation - a good example of how Guix is self-documenting. 
With this knowledge we have great power in customizing the system services but we unfortunately can't write our own yet.
</p>

<p>
Next time I'd like to look a little deeper into service definition and even define some basic services. After that we can move onto one of the most exciting parts - defining and building our own packages!
</p>
</div>
</div>
